{
    "News": [
        {
            "url": "https://wethinkcode.co.za/wp-content/uploads/2024/06/DSC_0244-scaled-1.webp",
            "title": "Specialisation in Curriculum: Offering Hope Amidst South Africa’s Youth Unemployment Crisis",
            "para": "Specialised curriculums ensure that students acquire theoretical knowledge and practical skills that are directly applicable in their chosen fields. When developing these programmes, tertiary education systems must consider the current and future needs of the job market, integrating continuous learning and collaboration with industry experts. This approach bridges the gap between education and employment and equips students with the adaptability and expertise necessary to thrive in a dynamic work environment.\n\nYouth unemployment remains a pressing challenge in South Africa, with recent statistics from Statistics South Africa indicating a staggering youth unemployment rate of 63.9%. Despite this daunting figure, pockets of progress and innovation offer hope.\n\nOne such area is the tech industry, which has shown a growing demand for skilled professionals. However, the gap between the skills provided by traditional education systems and those required by the industry is still wide. This disconnect underscores the critical need for targeted, industry-relevant training programmes that can bridge this divide and enhance youth employability.\n\nWeThinkCode_ is at the forefront of this effort, developing a curriculum that not only meets but anticipates the needs of the modern tech landscape, thereby significantly improving job placement rates for its graduates. By focusing on a keen understanding of fundamental concepts, practical skills, and continuous learning, WeThinkCode_ aims to equip young South Africans with the tools they need to thrive in an increasingly digital economy.\n\nIn today’s rapidly evolving tech landscape, specialisation is not just an advantage—it’s a necessity. As someone deeply involved in shaping the curriculum at WeThinkCode_, I’ve seen firsthand how our approach significantly enhances the employability of our graduates, providing them with the skills and adaptability needed to thrive in the dynamic South African tech industry.\n\nWhen we began designing the WeThinkCode_ curriculum in 2020, our primary goal was to align educational outcomes with industry needs. We engaged with successful software engineers and industry leaders to understand what makes a candidate truly valuable in the tech world. The result is a comprehensive programme that goes beyond basic coding. Our curriculum emphasizes fundamental software engineering concepts, practical application, and the development of essential soft skills.\n\nAt the heart of our programme is a strong foundation in software engineering principles. We teach students not just to code, but to understand the underlying concepts that make code work. This includes learning multiple programming languages and understanding how to apply core principles across different technologies. Our students are equipped to adapt to new tools and coding languages, making them versatile and resilient in the face of technological change.\n\nMoreover, our curriculum is intensely practical. Students engage in hands-on projects that simulate real-world scenarios. They work in teams to develop, test, and deploy software, learning to navigate the complexities of version control, documentation, and collaborative problem-solving. This practical experience ensures that they can hit the ground running in their first jobs.\n\nAdapting to the Future: Lifelong Learning and Industry Partnerships\n\nIn the tech industry, the ability to learn continuously is crucial. Our curriculum emphasizes this by teaching students how to learn new technologies and stay current with industry trends. This skill is indispensable in a field where advancements occur at a breakneck pace. We instill a mindset of lifelong learning, preparing our graduates to evolve with the industry.\n\nOur close collaboration with industry partners further enhances the relevance of our curriculum. These partnerships allow us to integrate current industry practices and technologies into our teaching. For instance, we align some of our practical content with the tools and frameworks used by our partners. Additionally, we offer students opportunities for certifications and additional training through these partnerships, further boosting their employability.\n\nThe Importance of Soft Skills in Tech\n\nTechnical prowess alone does not make a successful software engineer. Soft skills, such as effective communication, teamwork, and problem-solving, are equally important. At WeThinkCode_, we integrate soft skills training throughout our programme. Students learn to articulate their ideas clearly, collaborate effectively, and manage projects from inception to completion. These skills are critical in any professional setting, and our emphasis on them has been a key factor in the positive feedback we receive from employers.\n\nAddressing South Africa’s Unique Challenges\n\nThe South African tech industry faces unique challenges, including a high demand for skilled professionals and a significant gap between industry needs and the skills provided by traditional education systems. Our curriculum is designed to bridge this gap. By focusing on both technical and professional skills, we prepare students to meet the demands of local and international tech companies. Our graduates are not only job-ready but also equipped to contribute meaningfully to the industry from day one.\n\nLooking Ahead: Expanding Specialisation Opportunities\n\nWe are continually evolving our curriculum to include new specialisations. This year, we are introducing electives in data engineering and cloud development, with plans for future courses in cybersecurity and other emerging fields. These electives allow students to tailor their education to their interests and industry needs, providing them with targeted skills that enhance their career prospects.\n\nSpecialisation within the WeThinkCode_ curriculum is a cornerstone of our strategy to enhance youth employability in South Africa. By combining strong foundational knowledge, practical experience, continuous learning, and essential soft skills, we prepare our students to excel in the fast-paced tech industry. As we expand our offerings and deepen our industry partnerships, we remain committed to providing an education that is both relevant and transformative, empowering the next generation of South African tech professionals.\n\nBy Herman Lintvelt, Chief Technology Officer at WeThinkCode_"
        },
        {
            "url": "https://wethinkcode.co.za/wp-content/uploads/2024/06/DSC_0357-1.jpg.webp",
            "title": "Software academy seeks next cohort of tech talent",
            "para": "Software development academy WeThinkCode has opened applications for the 2024 cohort of software engineers.\n\nIn a statement issued this morning, the academy says it anticipates attracting over 25 000 applications from young people who are not in employment, education or training, and are looking for opportunities to access industry-relevant training and future-fit jobs.\n\nThe software engineers will be competing to secure one of 500 spots in the 2024 cohort starting in September.\n\nFurthermore, this cohort will be the first to earn the now NQF 6 qualification in software engineering accredited by the Quality Council For Trades and Occupations, the academy states.\n\n“WeThinkCode believes in breaking barriers and creating pathways to success for the youth of South Africa,” says Kelebogile Motlhamme, head of placements at WeThinkCode.\n\n“Our 2024 application season represents a life-changing opportunity for determined young people looking to participate in the growing digital economy, irrespective of their education background or prior experience.”\n\nWeThinkCode was launched in SA in 2015, with the mission to cultivate the next generation of top tech talent for South Africa’s economy. It aims to develop 100 000 coders in Africa over the next 10 years.\n\nThe academy has a 91% average placement rate within four months of graduation.\n\nAccording to WeThinkCode, through its partnership with IBM SkillsBuild, applicants have access to resources that will empower them to prepare for the online assessment and bootcamps, which are used to assess readiness for the programme.\n\nThey are guided through tailored learning plans to equip them for the application process, with free access to digital training courses and verifiable digital credentials in soft skills, artificial intelligence (AI), AI ethics, cyber security and more, it adds.\n\nThe IBM SkillsBuild platform provides learners with digital credentials and job role preparation – specifically focused on entry-level tech roles – and support to help them gain employment in the immediate future.\n\n“IBM South Africa is committed to enabling youth in this country from underrepresented communities with the relevant technology skills to not only enhance their chances of employability but to also build the pipeline of technology skills that will be required in the marketplace,” says Zeenat Dasoo, executive director, transformation and special projects at IBM South Africa.\n\n“Our collaboration with WeThinkCode is a complementary partnership aimed at empowering tomorrow’s workforce with the relevant skills required. Through leveraging our free online courses through IBM SkillsBuild, this cohort of software engineers will be able to enhance their skills and earn globally-recognised IBM credentials.”\n\nThe academy says it welcomes all applicants between the ages of 17 to 35, who can work in South Africa.\n\nApplications for the 2024 cohort will remain open until the end of July. To apply, click here."
        },
        {
            "url": "https://wethinkcode.co.za/wp-content/uploads/2024/09/CAPE-TOWN-CAMPUS.jpg.webp",
            "title": "WeThinkCode_ breaks graduate record",
            "para": "Software development academy WeThinkCode_ has celebrated its largest graduating class yet, with 360 graduates. The cohort, made up of 181 females and 179 males, highlights the role played by the organisation in creating equal opportunity in software education.\n\nRemarkably, 199 of these students have already secured internships, with the majority extending beyond six months, underscoring the growing demand for WeThinkCode_ graduates in the tech industry.\n\nThe inaugural WeThinkCode_ cohort in 2016 saw 106 students enrolled, with 93 graduating by 2018, achieving an 84% graduation rate and a 100% job placement rate. The 2017 cohort maintained this success, with 119 out of 144 students graduating by 2019, resulting in an 83% graduation rate and 100% job placement.\n\nIn 2020, the academy graduated its largest cohort to date, with 190 students, seeing a 90% graduation rate and a 95% job placement rate. The success of WeThinkCode_ graduates continues to underscore the organisation’s impact on the industry and its contribution to addressing South Africa’s unemployment crisis through innovative education and employment pathways.\n\nWeThinkCode_ now operates campuses in Johannesburg, Durban, and Cape Town, providing free, top-quality education and creating numerous employment opportunities for its graduates.\n\nThe academy’s model continues to attract industry partners, ensuring that students are equipped with the skills required to meet the ever-evolving demands of the tech industry."
        },
        {
            "url": "https://wethinkcode.co.za/wp-content/uploads/2024/09/WeThinkCode_Student.webp",
            "title": "WeThinkCode accelerates tech job placements for SA youth",
            "para": "In recent years, South Africa has faced a severe challenge with youth unemployment, exacerbated by the Covid-19 pandemic. Addressing this, WeThinkCode_ has demonstrated remarkable success in facilitating job placements for its graduates, with 86% of students securing employment upon completion of their training.\n\nThe academy’s innovative approach to tech education is designed to meet the evolving demands of the industry. By offering rigorous training in software engineering and focusing on practical, hands-on learning, WeThinkCode_ ensures that its graduates are well-prepared for the job market.\n\nThe academy’s curriculum is continually updated in collaboration with industry partners to reflect current trends and technologies. This alignment with industry needs enhances the employability of WeThinkCode_ graduates and provides them with a competitive edge in the tech sector.\n\nThe strong placement record of WeThinkCode_ graduates underscores the effectiveness of the academy’s model in bridging the skills gap and addressing the high levels of youth unemployment in South Africa."
        },
        {
            "url": "https://wethinkcode.co.za/wp-content/uploads/2024/01/2-1-1024x576-1.jpg.webp",
            "title": "Skills gap: WeThinkCode_ and System Verification team up",
            "para": "WeThinkCode_ has partnered with System Verification to tackle the skills gap in the tech industry, focusing on Test Automation and Quality Assurance.\n\nThe collaboration aims to address the shortage of skilled professionals in these critical areas by providing targeted training and upskilling opportunities. System Verification’s expertise in quality monitoring and analytics will enhance the training programme, ensuring that participants acquire the specialized knowledge and skills required to excel in these fields.\n\nThe partnership is part of WeThinkCode_’s broader strategy to align its curriculum with industry needs and provide students with relevant, cutting-edge skills that improve their employability and career prospects in the tech industry."
        },
        {
            "url": "https://wethinkcode.co.za/wp-content/uploads/2024/01/unnamed.webp",
            "title": "Public-private collab to create coding skills pipeline",
            "para": "WeThinkCode_ has partnered with Ekurhuleni West TVET College to pilot a new coding programme aimed at equipping South African youth with essential coding skills.\n\nThe collaboration seeks to bridge the gap between education and employment by creating a pipeline of skilled tech professionals. The initiative provides students with access to high-quality coding education and practical training, preparing them for the demands of the tech industry.\n\nThis public-private partnership reflects WeThinkCode_’s commitment to addressing the skills gap in South Africa and supporting the development of a highly skilled tech workforce."
        },
        {
            "url": "https://wethinkcode.co.za/wp-content/uploads/2024/03/MTN.webp",
            "title": "MTN welcomes 25 talented young people to develop in-house software solutions",
            "para": "MTN has welcomed 25 interns trained by WeThinkCode_ to develop in-house software solutions. This initiative highlights MTN’s commitment to fostering talent and driving innovation within the company.\n\nThe interns, who have completed rigorous training at WeThinkCode_, will contribute to MTN’s software development projects, bringing fresh perspectives and skills to the team. This collaboration underscores the value of industry partnerships in enhancing the skills and employability of young tech professionals.\n\nThe programme also reflects MTN’s dedication to inclusivity, with a significant number of female interns participating in this opportunity."
        },
        {
            "url": "https://wethinkcode.co.za/wp-content/uploads/2024/03/programmers_developers_coders_1500_800_1.webp",
            "title": "The programming skills South Africa needs right now",
            "para": "WeThinkCode_ has achieved a significant milestone by obtaining the NQF 6 Occupational Certificate in Software Engineering, which will be awarded to the 2024 graduating class.\n\nThis certification reflects the academy’s commitment to providing high-quality education that meets industry standards and enhances the employability of its graduates.\n\nThe NQF 6 qualification is designed to equip students with the essential programming skills required in today’s tech industry. It addresses the skills gap in South Africa and supports the development of a highly skilled workforce ready to tackle current and future challenges in the field of software engineering."
        },
        {
            "url": "https://wethinkcode.co.za/wp-content/uploads/2024/04/WeThinkCode_-Students.jpg.webp",
            "title": "Elevating Tech Talent: WeThinkCode_ Attains NQF 6 Occupational Certificate Accredited by QCTO",
            "para": "WeThinkCode_ has achieved accreditation for its software engineering programme with the NQF 6 Occupational Certificate, awarded by the Quality Council for Trades and Occupations (QCTO).\n\nThis accreditation marks a significant milestone for the academy, validating its curriculum and enhancing the value of its qualification in the job market.\n\nThe NQF 6 certificate represents a high standard of education and training, aligning with industry requirements and providing graduates with a competitive edge in their careers. WeThinkCode_ continues to focus on delivering relevant and impactful education to prepare students for successful careers in tech."
        }
    ]
}
